import _ from 'lodash'

interface ResultItem {
  data: {
    目标收入: number
    实际收入: number
    目标达成率: number
    收入月环比: number
  }
  path: string[]
  pathKey: string
}

// interface Result {
//   [key: string]: ResultItem
// }

export const dataConfig = {
  forenoon: {
    'forenoon-9': {
      上半年: {
        目标收入: 6,
        实际收入: 6,
        目标达成率: 6,
        收入月环比: 6,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 18,
        实际收入: 18,
        目标达成率: 18,
        收入月环比: 18,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'forenoon-10': {
      上半年: {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 19,
        实际收入: 19,
        目标达成率: 19,
        收入月环比: 19,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'forenoon-11': {
      上半年: {
        目标收入: 8,
        实际收入: 8,
        目标达成率: 8,
        收入月环比: 8,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 20,
        实际收入: 20,
        目标达成率: 20,
        收入月环比: 20,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    上半年: {
      目标收入: 21,
      实际收入: 21,
      目标达成率: 21,
      收入月环比: 21,
      '2020-01': {
        目标收入: 1,
        实际收入: 1,
        目标达成率: 1,
        收入月环比: 1,
      },
      '2020-02': {
        目标收入: 2,
        实际收入: 2,
        目标达成率: 2,
        收入月环比: 2,
      },
      '2020-03': {
        目标收入: 3,
        实际收入: 3,
        目标达成率: 3,
        收入月环比: 3,
      },
      '2020-04': {
        目标收入: 4,
        实际收入: 4,
        目标达成率: 4,
        收入月环比: 4,
      },
      '2020-05': {
        目标收入: 5,
        实际收入: 5,
        目标达成率: 5,
        收入月环比: 5,
      },
      '2020-06': {
        目标收入: 6,
        实际收入: 6,
        目标达成率: 6,
        收入月环比: 6,
      },
    },
    下半年: {
      目标收入: 57,
      实际收入: 57,
      目标达成率: 57,
      收入月环比: 57,
      '2020-07': {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
      },
      '2020-08': {
        目标收入: 8,
        实际收入: 8,
        目标达成率: 8,
        收入月环比: 8,
      },
      '2020-09': {
        目标收入: 9,
        实际收入: 9,
        目标达成率: 9,
        收入月环比: 9,
      },
      '2020-10': {
        目标收入: 10,
        实际收入: 10,
        目标达成率: 10,
        收入月环比: 10,
      },
      '2020-11': {
        目标收入: 11,
        实际收入: 11,
        目标达成率: 11,
        收入月环比: 11,
      },
      '2020-12': {
        目标收入: 12,
        实际收入: 12,
        目标达成率: 12,
        收入月环比: 12,
      },
    },
  },
  afternoon: {
    'afternoon-9': {
      上半年: {
        目标收入: 5,
        实际收入: 5,
        目标达成率: 5,
        收入月环比: 5,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 18,
        实际收入: 18,
        目标达成率: 18,
        收入月环比: 18,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'afternoon-10': {
      上半年: {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 19,
        实际收入: 19,
        目标达成率: 19,
        收入月环比: 19,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'afternoon-11': {
      上半年: {
        目标收入: 8,
        实际收入: 8,
        目标达成率: 8,
        收入月环比: 8,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 20,
        实际收入: 20,
        目标达成率: 20,
        收入月环比: 20,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    上半年: {
      目标收入: 20,
      实际收入: 21,
      目标达成率: 21,
      收入月环比: 21,
      '2020-01': {
        目标收入: 1,
        实际收入: 1,
        目标达成率: 1,
        收入月环比: 1,
      },
      '2020-02': {
        目标收入: 2,
        实际收入: 2,
        目标达成率: 2,
        收入月环比: 2,
      },
      '2020-03': {
        目标收入: 3,
        实际收入: 3,
        目标达成率: 3,
        收入月环比: 3,
      },
      '2020-04': {
        目标收入: 4,
        实际收入: 4,
        目标达成率: 4,
        收入月环比: 4,
      },
      '2020-05': {
        目标收入: 5,
        实际收入: 5,
        目标达成率: 5,
        收入月环比: 5,
      },
      '2020-06': {
        目标收入: 6,
        实际收入: 6,
        目标达成率: 6,
        收入月环比: 6,
      },
    },
    下半年: {
      目标收入: 57,
      实际收入: 57,
      目标达成率: 57,
      收入月环比: 57,
      '2020-07': {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
      },
      '2020-08': {
        目标收入: 8,
        实际收入: 8,
        目标达成率: 8,
        收入月环比: 8,
      },
      '2020-09': {
        目标收入: 9,
        实际收入: 9,
        目标达成率: 9,
        收入月环比: 9,
      },
      '2020-10': {
        目标收入: 10,
        实际收入: 10,
        目标达成率: 10,
        收入月环比: 10,
      },
      '2020-11': {
        目标收入: 11,
        实际收入: 11,
        目标达成率: 11,
        收入月环比: 11,
      },
      '2020-12': {
        目标收入: 12,
        实际收入: 12,
        目标达成率: 12,
        收入月环比: 12,
      },
    },
  },
  evening: {
    'evening-9': {
      上半年: {
        目标收入: 6,
        实际收入: 6,
        目标达成率: 6,
        收入月环比: 6,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 18,
        实际收入: 18,
        目标达成率: 18,
        收入月环比: 18,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'evening-10': {
      上半年: {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 19,
        实际收入: 19,
        目标达成率: 19,
        收入月环比: 19,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    'evening-11': {
      上半年: {
        目标收入: 9,
        实际收入: 9,
        目标达成率: 9,
        收入月环比: 9,
        '2020-01': {
          目标收入: 1,
          实际收入: 1,
          目标达成率: 1,
          收入月环比: 1,
        },
        '2020-02': {
          目标收入: 2,
          实际收入: 2,
          目标达成率: 2,
          收入月环比: 2,
        },
        '2020-03': {
          目标收入: 3,
          实际收入: 3,
          目标达成率: 3,
          收入月环比: 3,
        },
        '2020-04': {
          目标收入: 4,
          实际收入: 4,
          目标达成率: 4,
          收入月环比: 4,
        },
        '2020-05': {
          目标收入: 5,
          实际收入: 5,
          目标达成率: 5,
          收入月环比: 5,
        },
        '2020-06': {
          目标收入: 6,
          实际收入: 6,
          目标达成率: 6,
          收入月环比: 6,
        },
      },
      下半年: {
        目标收入: 20,
        实际收入: 20,
        目标达成率: 20,
        收入月环比: 20,
        '2020-07': {
          目标收入: 7,
          实际收入: 7,
          目标达成率: 7,
          收入月环比: 7,
        },
        '2020-08': {
          目标收入: 8,
          实际收入: 8,
          目标达成率: 8,
          收入月环比: 8,
        },
        '2020-09': {
          目标收入: 9,
          实际收入: 9,
          目标达成率: 9,
          收入月环比: 9,
        },
        '2020-10': {
          目标收入: 10,
          实际收入: 10,
          目标达成率: 10,
          收入月环比: 10,
        },
        '2020-11': {
          目标收入: 11,
          实际收入: 11,
          目标达成率: 11,
          收入月环比: 11,
        },
        '2020-12': {
          目标收入: 12,
          实际收入: 12,
          目标达成率: 12,
          收入月环比: 12,
        },
      },
    },
    上半年: {
      目标收入: 22,
      实际收入: 21,
      目标达成率: 21,
      收入月环比: 21,
      '2020-01': {
        目标收入: 1,
        实际收入: 1,
        目标达成率: 1,
        收入月环比: 1,
      },
      '2020-02': {
        目标收入: 2,
        实际收入: 2,
        目标达成率: 2,
        收入月环比: 2,
      },
      '2020-03': {
        目标收入: 3,
        实际收入: 3,
        目标达成率: 3,
        收入月环比: 3,
      },
      '2020-04': {
        目标收入: 4,
        实际收入: 4,
        目标达成率: 4,
        收入月环比: 4,
      },
      '2020-05': {
        目标收入: 5,
        实际收入: 5,
        目标达成率: 5,
        收入月环比: 5,
      },
      '2020-06': {
        目标收入: 6,
        实际收入: 6,
        目标达成率: 6,
        收入月环比: 6,
      },
    },
    下半年: {
      目标收入: 57,
      实际收入: 57,
      目标达成率: 57,
      收入月环比: 57,
      '2020-07': {
        目标收入: 7,
        实际收入: 7,
        目标达成率: 7,
        收入月环比: 7,
      },
      '2020-08': {
        目标收入: 8,
        实际收入: 8,
        目标达成率: 8,
        收入月环比: 8,
      },
      '2020-09': {
        目标收入: 9,
        实际收入: 9,
        目标达成率: 9,
        收入月环比: 9,
      },
      '2020-10': {
        目标收入: 10,
        实际收入: 10,
        目标达成率: 10,
        收入月环比: 10,
      },
      '2020-11': {
        目标收入: 11,
        实际收入: 11,
        目标达成率: 11,
        收入月环比: 11,
      },
      '2020-12': {
        目标收入: 12,
        实际收入: 12,
        目标达成率: 12,
        收入月环比: 12,
      },
    },
  },
}

function getValue(str: string): ResultItem {
  const path = str
    .split('|')
    .map((i: string) => i.split('_').map((j: string) => j.split(':')[1]))
    .reduce((a, b) => a.concat(b))
  return { data: _.get(dataConfig, path), path, pathKey: str }
}

export const getValues = async (requestPathArr: string[], targets: string[], sortOption: any): Promise<any> => {
  // console.log(requestPathArr, sortOption)
  const arr: ResultItem[] = []
  let sortStartIndex = -1
  let sortEndIndex = -1
  if (sortOption !== undefined && sortOption.sortOrder !== 'none') {
    const { rowSortKeys, sortOrder, targetKey } = sortOption
    rowSortKeys.forEach((key: string) => {
      arr.push(getValue(key))
    })
    if (sortOrder === 'asc') {
      arr.sort((a: any, b: any) => a.data[targetKey] - b.data[targetKey])
    }
    if (sortOrder === 'desc') {
      arr.sort((a: any, b: any) => b.data[targetKey] - a.data[targetKey])
    }
    sortStartIndex = 0
    sortEndIndex = arr.length - 1
  }
  requestPathArr.forEach((item: string) => {
    !arr.some((i: ResultItem) => i.pathKey === item) && arr.push(getValue(item))
  })
  return {
    result: arr,
    sortStartIndex,
    sortEndIndex,
    sortOption,
  }
}
